#### Import Libraries & Dataset

In [1]:
import numpy
import pandas

# import the titanic dataset
titanic = pandas.read_csv('Titanic.csv')

# brief sumary the dataset
titanic_nona = titanic.dropna()
titanic_nona.describe()

              Age    Survived
count  756.000000  756.000000
mean    30.397989    0.414021
std     14.259049    0.492878
min      0.170000    0.000000
25%     21.000000    0.000000
50%     28.000000    0.000000
75%     39.000000    1.000000
max     71.000000    1.000000

#### Ex.3.1 Merge the first and last 5 items of Titanic dataset with new row indices 0-9.

In [2]:
# Code for Ex3.1

titanic_head10 = titanic.head(5)
titanic_tail10 = titanic.tail(5)
pandas.concat([titanic_head10, titanic_tail10], ignore_index=True)

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1
5,"Zakarian, Mr Artun",3rd,27.00,male,0
6,"Zakarian, Mr Maprieder",3rd,26.00,male,0
7,"Zenni, Mr Philip",3rd,22.00,male,0
8,"Lievens, Mr Rene",3rd,24.00,male,0
9,"Zimmerman, Leo",3rd,29.00,male,0

#### Ex.3.2 Merge the following three provided DataFrames with their shared columns, and set the new index as 0-5.

In [3]:
# Code for Ex3.2

df1 = titanic.head(2)
df2 = titanic.iloc[500:502]
df3 = titanic.tail(2)

del df1['Name']
del df2['Sex']
del df3['Age']

pandas.concat([df1, df2, df3], join='inner', ignore_index=True)

  PClass  Survived
0    1st         1
1    1st         0
2    2nd         1
3    2nd         1
4    3rd         0
5    3rd         0

#### Ex.3.3 Merge the following three provided DataFrames with complete columns as the original Titanic dataset, and set the new index as 0-5.

In [4]:
# Code for Ex3.3

df1 = titanic.head(2)
df2 = titanic.iloc[500:502]
df3 = titanic.tail(2)

del df1['Name']
del df2['PClass']
del df3['Name']

pandas.concat([df1, df2, df3], join='outer', ignore_index=True)

C:\Users\Prasanth\Anaconda3\envs\deeplearning\lib\site-packages\ipykernel_launcher.py:11: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  # This is added back by InteractiveShellApp.init_path()

    Age                              Name PClass     Sex  Survived
0  29.0                               NaN    1st  female         1
1   2.0                               NaN    1st  female         0
2  13.0  Mellenger, Miss Madeleine Violet    NaN  female         1
3  19.0           Mellor, Mr William John    NaN    male         1
4  24.0                               NaN    3rd    male         0
5  29.0                               NaN    3rd    male         0

#### Ex.3.4 Group the dataset by Age, and brief summary each group. ( Please uniformly seperate the age into 8 groups, drop NaN if needed )

In [4]:
# Code for Ex3.4

# group by age
age_cut = pandas.cut(titanic_nona['Age'], [0, 10, 20, 30, 40, 50, 60, 70, 80])
titanic_byAge = titanic_nona.groupby(age_cut)

# summary
titanic_byAge['Sex'].describe()

Age
(0, 10]   count       55
          unique       2
          top       male
          freq        28
(10, 20]  count      117
          unique       2
          top       male
          freq        62
(20, 30]  count      260
          unique       2
          top       male
          freq       174
(30, 40]  count      150
          unique       2
          top       male
          freq        94
(40, 50]  count      104
          unique       2
          top       male
          freq        66
(50, 60]  count       48
          unique       2
          top       male
          freq        28
(60, 70]  count       19
          unique       2
          top       male
          freq        13
(70, 80]  count        3
          unique       1
          top       male
          freq         3
dtype: object

#### Ex.3.5 Group the dataset by PClass and Sex, and return the average age of the these groups. ( drop NaN if needed )

In [13]:
# Code for Ex3.5

titanic.pivot_table('Age', index='Sex', columns='PClass')

PClass        1st        2nd        3rd
Sex
female  37.772277  27.388235  22.776176
male    41.199360  28.910472  26.357222